; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_4)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 link8 link9 - link
    angle0 angle30 angle60 angle90 angle120 angle150 angle180 angle210 angle240 angle270 angle300 angle330 - angle)
(:init
    (AngleOrd angle0 angle30)
    (AngleOrd angle30 angle60)
    (AngleOrd angle60 angle90)
    (AngleOrd angle90 angle120)
    (AngleOrd angle120 angle150)
    (AngleOrd angle150 angle180)
    (AngleOrd angle180 angle210)
    (AngleOrd angle210 angle240)
    (AngleOrd angle240 angle270)
    (AngleOrd angle270 angle300)
    (AngleOrd angle300 angle330)
    (AngleOrd angle330 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)
    (IsChildOf link8 link7)
    (IsChildOf link9 link8)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)
    (Affected link7 link1)
    (Affected link7 link2)
    (Affected link7 link3)
    (Affected link7 link4)
    (Affected link7 link5)
    (Affected link7 link6)
    (Affected link8 link1)
    (Affected link8 link2)
    (Affected link8 link3)
    (Affected link8 link4)
    (Affected link8 link5)
    (Affected link8 link6)
    (Affected link8 link7)
    (Affected link9 link1)
    (Affected link9 link2)
    (Affected link9 link3)
    (Affected link9 link4)
    (Affected link9 link5)
    (Affected link9 link6)
    (Affected link9 link7)
    (Affected link9 link8)

    (HasAngle angle270 link1)
    (HasAngle angle180 link2)
    (HasAngle angle120 link3)
    (HasAngle angle210 link4)
    (HasAngle angle30 link5)
    (HasAngle angle90 link6)
    (HasAngle angle150 link7)
    (HasAngle angle270 link8)
    (HasAngle angle240 link9)
)
(:goal
(and
    (HasAngle angle330 link1)
    (HasAngle angle120 link2)
    (HasAngle angle180 link3)
    (HasAngle angle30 link4)
    (HasAngle angle60 link5)
    (HasAngle angle120 link6)
    (HasAngle angle180 link7)
    (HasAngle angle60 link8)
    (HasAngle angle270 link9)
    )
)
)

; plan
1. (increase_angle link1 angle270 angle300)
   deleted: (hasangle angle270 link1) (hasangle angle180 link2) (hasangle angle120 link3) (hasangle angle210 link4) (hasangle angle30 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle270 link8) (hasangle angle240 link9)
   added: (hasangle angle300 link1) (hasangle angle210 link2) (hasangle angle150 link3) (hasangle angle240 link4) (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle180 link7) (hasangle angle300 link8) (hasangle angle270 link9)
   goals met: 4 of 9
2. (increase_angle link1 angle300 angle330)
   deleted: (hasangle angle300 link1) (hasangle angle210 link2) (hasangle angle150 link3) (hasangle angle240 link4) (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle180 link7) (hasangle angle300 link8) (hasangle angle270 link9)
   added: (hasangle angle330 link1) (hasangle angle240 link2) (hasangle angle180 link3) (hasangle angle270 link4) (hasangle angle90 link5) (hasangle angle150 link6) (hasangle angle210 link7) (hasangle angle330 link8) (hasangle angle300 link9)
   goals met: 2 of 9
3. (decrease_angle link2 angle240 angle210)
   deleted: (hasangle angle240 link2) (hasangle angle180 link3) (hasangle angle270 link4) (hasangle angle90 link5) (hasangle angle150 link6) (hasangle angle210 link7) (hasangle angle330 link8) (hasangle angle300 link9)
   added: (hasangle angle210 link2) (hasangle angle150 link3) (hasangle angle240 link4) (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle180 link7) (hasangle angle300 link8) (hasangle angle270 link9)
   goals met: 5 of 9
4. (decrease_angle link2 angle210 angle180)
   deleted: (hasangle angle210 link2) (hasangle angle150 link3) (hasangle angle240 link4) (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle180 link7) (hasangle angle300 link8) (hasangle angle270 link9)
   added: (hasangle angle180 link2) (hasangle angle120 link3) (hasangle angle210 link4) (hasangle angle30 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle270 link8) (hasangle angle240 link9)
   goals met: 1 of 9
5. (decrease_angle link2 angle180 angle150)
   deleted: (hasangle angle180 link2) (hasangle angle120 link3) (hasangle angle210 link4) (hasangle angle30 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle270 link8) (hasangle angle240 link9)
   added: (hasangle angle150 link2) (hasangle angle90 link3) (hasangle angle180 link4) (hasangle angle0 link5) (hasangle angle60 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle210 link9)
   goals met: 1 of 9
6. (decrease_angle link2 angle150 angle120)
   deleted: (hasangle angle150 link2) (hasangle angle90 link3) (hasangle angle180 link4) (hasangle angle0 link5) (hasangle angle60 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle210 link9)
   added: (hasangle angle120 link2) (hasangle angle60 link3) (hasangle angle150 link4) (hasangle angle330 link5) (hasangle angle30 link6) (hasangle angle90 link7) (hasangle angle210 link8) (hasangle angle180 link9)
   goals met: 2 of 9
7. (increase_angle link3 angle60 angle90)
   deleted: (hasangle angle60 link3) (hasangle angle150 link4) (hasangle angle330 link5) (hasangle angle30 link6) (hasangle angle90 link7) (hasangle angle210 link8) (hasangle angle180 link9)
   added: (hasangle angle90 link3) (hasangle angle180 link4) (hasangle angle0 link5) (hasangle angle60 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle210 link9)
   goals met: 2 of 9
8. (increase_angle link3 angle90 angle120)
   deleted: (hasangle angle90 link3) (hasangle angle180 link4) (hasangle angle0 link5) (hasangle angle60 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle210 link9)
   added: (hasangle angle120 link3) (hasangle angle210 link4) (hasangle angle30 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle270 link8) (hasangle angle240 link9)
   goals met: 2 of 9
9. (increase_angle link3 angle120 angle150)
   deleted: (hasangle angle120 link3) (hasangle angle210 link4) (hasangle angle30 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle270 link8) (hasangle angle240 link9)
   added: (hasangle angle150 link3) (hasangle angle240 link4) (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle180 link7) (hasangle angle300 link8) (hasangle angle270 link9)
   goals met: 6 of 9
10. (increase_angle link3 angle150 angle180)
   deleted: (hasangle angle150 link3) (hasangle angle240 link4) (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle180 link7) (hasangle angle300 link8) (hasangle angle270 link9)
   added: (hasangle angle180 link3) (hasangle angle270 link4) (hasangle angle90 link5) (hasangle angle150 link6) (hasangle angle210 link7) (hasangle angle330 link8) (hasangle angle300 link9)
   goals met: 3 of 9
11. (increase_angle link4 angle270 angle300)
   deleted: (hasangle angle270 link4) (hasangle angle90 link5) (hasangle angle150 link6) (hasangle angle210 link7) (hasangle angle330 link8) (hasangle angle300 link9)
   added: (hasangle angle300 link4) (hasangle angle120 link5) (hasangle angle180 link6) (hasangle angle240 link7) (hasangle angle0 link8) (hasangle angle330 link9)
   goals met: 3 of 9
12. (increase_angle link4 angle300 angle330)
   deleted: (hasangle angle300 link4) (hasangle angle120 link5) (hasangle angle180 link6) (hasangle angle240 link7) (hasangle angle0 link8) (hasangle angle330 link9)
   added: (hasangle angle330 link4) (hasangle angle150 link5) (hasangle angle210 link6) (hasangle angle270 link7) (hasangle angle30 link8) (hasangle angle0 link9)
   goals met: 3 of 9
13. (increase_angle link4 angle330 angle0)
   deleted: (hasangle angle330 link4) (hasangle angle150 link5) (hasangle angle210 link6) (hasangle angle270 link7) (hasangle angle30 link8) (hasangle angle0 link9)
   added: (hasangle angle0 link4) (hasangle angle180 link5) (hasangle angle240 link6) (hasangle angle300 link7) (hasangle angle60 link8) (hasangle angle30 link9)
   goals met: 4 of 9
14. (increase_angle link4 angle0 angle30)
   deleted: (hasangle angle0 link4) (hasangle angle180 link5) (hasangle angle240 link6) (hasangle angle300 link7) (hasangle angle60 link8) (hasangle angle30 link9)
   added: (hasangle angle30 link4) (hasangle angle210 link5) (hasangle angle270 link6) (hasangle angle330 link7) (hasangle angle90 link8) (hasangle angle60 link9)
   goals met: 4 of 9
15. (decrease_angle link5 angle210 angle180)
   deleted: (hasangle angle210 link5) (hasangle angle270 link6) (hasangle angle330 link7) (hasangle angle90 link8) (hasangle angle60 link9)
   added: (hasangle angle180 link5) (hasangle angle240 link6) (hasangle angle300 link7) (hasangle angle60 link8) (hasangle angle30 link9)
   goals met: 5 of 9
16. (decrease_angle link5 angle180 angle150)
   deleted: (hasangle angle180 link5) (hasangle angle240 link6) (hasangle angle300 link7) (hasangle angle60 link8) (hasangle angle30 link9)
   added: (hasangle angle150 link5) (hasangle angle210 link6) (hasangle angle270 link7) (hasangle angle30 link8) (hasangle angle0 link9)
   goals met: 4 of 9
17. (decrease_angle link5 angle150 angle120)
   deleted: (hasangle angle150 link5) (hasangle angle210 link6) (hasangle angle270 link7) (hasangle angle30 link8) (hasangle angle0 link9)
   added: (hasangle angle120 link5) (hasangle angle180 link6) (hasangle angle240 link7) (hasangle angle0 link8) (hasangle angle330 link9)
   goals met: 4 of 9
18. (decrease_angle link5 angle120 angle90)
   deleted: (hasangle angle120 link5) (hasangle angle180 link6) (hasangle angle240 link7) (hasangle angle0 link8) (hasangle angle330 link9)
   added: (hasangle angle90 link5) (hasangle angle150 link6) (hasangle angle210 link7) (hasangle angle330 link8) (hasangle angle300 link9)
   goals met: 4 of 9
19. (decrease_angle link9 angle300 angle270)
   deleted: (hasangle angle300 link9)
   added: (hasangle angle270 link9)
   goals met: 5 of 9
20. (decrease_angle link9 angle270 angle240)
   deleted: (hasangle angle270 link9)
   added: (hasangle angle240 link9)
   goals met: 4 of 9
21. (increase_angle link8 angle330 angle0)
   deleted: (hasangle angle330 link8) (hasangle angle240 link9)
   added: (hasangle angle0 link8) (hasangle angle270 link9)
   goals met: 5 of 9
22. (decrease_angle link1 angle330 angle300)
   deleted: (hasangle angle330 link1) (hasangle angle120 link2) (hasangle angle180 link3) (hasangle angle30 link4) (hasangle angle90 link5) (hasangle angle150 link6) (hasangle angle210 link7) (hasangle angle0 link8) (hasangle angle270 link9)
   added: (hasangle angle300 link1) (hasangle angle90 link2) (hasangle angle150 link3) (hasangle angle0 link4) (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle180 link7) (hasangle angle330 link8) (hasangle angle240 link9)
   goals met: 3 of 9
23. (increase_angle link8 angle330 angle0)
   deleted: (hasangle angle330 link8) (hasangle angle240 link9)
   added: (hasangle angle0 link8) (hasangle angle270 link9)
   goals met: 4 of 9
24. (decrease_angle link9 angle270 angle240)
   deleted: (hasangle angle270 link9)
   added: (hasangle angle240 link9)
   goals met: 3 of 9
25. (increase_angle link8 angle0 angle30)
   deleted: (hasangle angle0 link8) (hasangle angle240 link9)
   added: (hasangle angle30 link8) (hasangle angle270 link9)
   goals met: 4 of 9
26. (decrease_angle link5 angle60 angle30)
   deleted: (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle180 link7) (hasangle angle30 link8) (hasangle angle270 link9)
   added: (hasangle angle30 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle0 link8) (hasangle angle240 link9)
   goals met: 0 of 9
27. (increase_angle link1 angle300 angle330)
   deleted: (hasangle angle300 link1) (hasangle angle90 link2) (hasangle angle150 link3) (hasangle angle0 link4) (hasangle angle30 link5) (hasangle angle90 link6) (hasangle angle150 link7) (hasangle angle0 link8) (hasangle angle240 link9)
   added: (hasangle angle330 link1) (hasangle angle120 link2) (hasangle angle180 link3) (hasangle angle30 link4) (hasangle angle60 link5) (hasangle angle120 link6) (hasangle angle180 link7) (hasangle angle30 link8) (hasangle angle270 link9)
   goals met: 8 of 9
28. (increase_angle link8 angle30 angle60)
   deleted: (hasangle angle30 link8) (hasangle angle270 link9)
   added: (hasangle angle60 link8) (hasangle angle300 link9)
   goals met: 8 of 9
29. (decrease_angle link9 angle300 angle270)
   deleted: (hasangle angle300 link9)
   added: (hasangle angle270 link9)
   goals met: 9 of 9
